; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v5 ?v4)
             (pred_12 ?v2 ?v3)
             (pred_1 ?v5 ?v3)
             (pred_5 ?v11 ?v5 )
	     (pred_7 ?v5)
             (pred_6 ?v1)
             (pred_3 ?v2)
             (pred_8 ?v3)
             (pred_2 ?v5)
             (pred_4 ?v2)
             (pred_10 ?v5)
             (pred_9 ))



(:action op_4
:parameters (?v13 ?v9 ?v8 ?v6)
:precondition (and (pred_6 ?v13) (pred_6 ?v9) (pred_3 ?v8) (pred_8 ?v6)
          (pred_11 ?v13 ?v9) (pred_12 ?v8 ?v6)
                   (pred_1 ?v9 ?v6) (pred_7 ?v13) 
                   (pred_2 ?v9) (pred_4 ?v8))
:effect (and  (pred_10 ?v9) (not (pred_2 ?v9))))


(:action op_3
:parameters (?v13 ?v12)
:precondition (and (pred_6 ?v13) (pred_6 ?v12)
               (pred_7 ?v13) (pred_11 ?v13 ?v12) (pred_10 ?v12))
:effect (and (pred_7 ?v12) (not (pred_7 ?v13))))

(:action op_5
:parameters (?v13 ?v8)
:precondition (and (pred_6 ?v13) (pred_3 ?v8) 
                  (pred_7 ?v13) (pred_5 ?v8 ?v13) (pred_9 ))
:effect (and (pred_4 ?v8)
   (not (pred_5 ?v8 ?v13)) (not (pred_9 ))))


(:action op_1
:parameters (?v13 ?v10 ?v7)
:precondition (and (pred_6 ?v13) (pred_3 ?v10) (pred_3 ?v7)
                  (pred_7 ?v13) (pred_4 ?v7) (pred_5 ?v10 ?v13))
:effect (and (pred_4 ?v10) (pred_5 ?v7 ?v13)
        (not (pred_4 ?v7)) (not (pred_5 ?v10 ?v13))))

(:action op_2
:parameters (?v13 ?v8)
:precondition (and (pred_6 ?v13) (pred_3 ?v8) 
                  (pred_7 ?v13) (pred_4 ?v8))
:effect (and (pred_9 ) (pred_5 ?v8 ?v13) (not (pred_4 ?v8)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_06 obj_11 obj_20 obj_14 obj_18 obj_12 obj_04 obj_08 obj_09 obj_10 obj_21 obj_15 obj_17 obj_05 obj_16
    obj_07 obj_03
    obj_02 obj_19 obj_13
    )

    (:init
       (pred_9)

       (pred_6 obj_01)
       (pred_6 obj_06)
       (pred_6 obj_11)
       (pred_6 obj_20)
       (pred_6 obj_14)
       (pred_6 obj_18)
       (pred_6 obj_12)
       (pred_6 obj_04)
       (pred_6 obj_08)
       (pred_6 obj_09)
       (pred_6 obj_10)
       (pred_6 obj_21)
       (pred_6 obj_15)
       (pred_6 obj_17)
       (pred_6 obj_05)
       (pred_6 obj_16)
       (pred_8 obj_07)
       (pred_8 obj_03)
       (pred_3 obj_02)
       (pred_3 obj_19)
       (pred_3 obj_13)

       (pred_11 obj_01 obj_14)
       (pred_11 obj_01 obj_06)
       (pred_11 obj_06 obj_18)
       (pred_11 obj_06 obj_11)
       (pred_11 obj_06 obj_01)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_11 obj_20)
       (pred_11 obj_11 obj_06)
       (pred_11 obj_20 obj_04)
       (pred_11 obj_20 obj_11)
       (pred_11 obj_14 obj_08)
       (pred_11 obj_14 obj_18)
       (pred_11 obj_14 obj_01)
       (pred_11 obj_18 obj_09)
       (pred_11 obj_18 obj_12)
       (pred_11 obj_18 obj_06)
       (pred_11 obj_18 obj_14)
       (pred_11 obj_12 obj_10)
       (pred_11 obj_12 obj_04)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_12 obj_18)
       (pred_11 obj_04 obj_21)
       (pred_11 obj_04 obj_20)
       (pred_11 obj_04 obj_12)
       (pred_11 obj_08 obj_15)
       (pred_11 obj_08 obj_09)
       (pred_11 obj_08 obj_14)
       (pred_11 obj_09 obj_17)
       (pred_11 obj_09 obj_10)
       (pred_11 obj_09 obj_18)
       (pred_11 obj_09 obj_08)
       (pred_11 obj_10 obj_05)
       (pred_11 obj_10 obj_21)
       (pred_11 obj_10 obj_12)
       (pred_11 obj_10 obj_09)
       (pred_11 obj_21 obj_16)
       (pred_11 obj_21 obj_04)
       (pred_11 obj_21 obj_10)
       (pred_11 obj_15 obj_17)
       (pred_11 obj_15 obj_08)
       (pred_11 obj_17 obj_05)
       (pred_11 obj_17 obj_09)
       (pred_11 obj_17 obj_15)
       (pred_11 obj_05 obj_16)
       (pred_11 obj_05 obj_10)
       (pred_11 obj_05 obj_17)
       (pred_11 obj_16 obj_21)
       (pred_11 obj_16 obj_05)
       (pred_2 obj_14)
       (pred_2 obj_15)
       (pred_2 obj_01)
       (pred_1  obj_14 obj_07)
       (pred_1  obj_15 obj_03)
       (pred_1  obj_01 obj_07)
       (pred_10 obj_06)
       (pred_10 obj_11)
       (pred_10 obj_20)
       (pred_10 obj_18)
       (pred_10 obj_12)
       (pred_10 obj_04)
       (pred_10 obj_08)
       (pred_10 obj_09)
       (pred_10 obj_10)
       (pred_10 obj_21)
       (pred_10 obj_17)
       (pred_10 obj_05)
       (pred_10 obj_16)

       (pred_12  obj_02 obj_07)
       (pred_12  obj_19 obj_03)
       (pred_12  obj_13 obj_03)
       (pred_5 obj_02 obj_21)
       (pred_5 obj_19 obj_18)
       (pred_5 obj_13 obj_09)
       (pred_7 obj_18)
    )

    (:goal (and
       (pred_5 obj_02 obj_09)
    ))
(:constraints
  (always (not (pred_7 obj_10)))
)
)

; plan
1. (op_3 obj_18 obj_12)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_12)
   goals met: 0 of 1
2. (op_3 obj_12 obj_04)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_04)
   goals met: 0 of 1
3. (op_3 obj_04 obj_21)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_21)
   goals met: 0 of 1
4. (op_5 obj_21 obj_02)
   deleted: (pred_5 obj_02 obj_21) (pred_9)
   added: (pred_4 obj_02)
   goals met: 0 of 1
5. (op_3 obj_21 obj_04)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_04)
   goals met: 0 of 1
6. (op_3 obj_04 obj_12)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_12)
   goals met: 0 of 1
7. (op_3 obj_12 obj_18)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_18)
   goals met: 0 of 1
8. (op_3 obj_18 obj_09)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_09)
   goals met: 0 of 1
9. (op_1 obj_09 obj_13 obj_02)
   deleted: (pred_4 obj_02) (pred_5 obj_13 obj_09)
   added: (pred_4 obj_13) (pred_5 obj_02 obj_09)
   goals met: 1 of 1
